Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70Q19.xml
        <register caption="Interrupt Mask Register" name="ACC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Status Register" name="ACC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="Comparison Edge (cleared on read)" mask="0x00000001" name="CE"/>
          <bitfield caption="Synchronized Comparator Output" mask="0x00000002" name="SCO"/>
          <bitfield caption="Flag Mask" mask="0x80000000" name="MASK"/>
        </register>
        <register caption="Analog Control Register" name="ACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Current Selection" mask="0x00000001" name="ISEL" values="ACC_ACR__ISEL"/>
          <bitfield caption="Hysteresis Selection" mask="0x00000006" name="HYST"/>
        </register>
        <register caption="Write Protection Mode Register" name="ACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
        </register>
      </register-group>
      <value-group caption="" name="ACC_MR__SELMINUS">
        <value caption="Select TS" name="TS" value="0x0"/>
        <value caption="Select ADVREFP" name="ADVREFP" value="0x1"/>
        <value caption="Select DAC0" name="DAC0" value="0x2"/>
        <value caption="Select DAC1" name="DAC1" value="0x3"/>
        <value caption="Select AFE0_AD0" name="AFE0_AD0" value="0x4"/>
        <value caption="Select AFE0_AD1" name="AFE0_AD1" value="0x5"/>
        <value caption="Select AFE0_AD2" name="AFE0_AD2" value="0x6"/>
        <value caption="Select AFE0_AD3" name="AFE0_AD3" value="0x7"/>
      </value-group>
      <value-group caption="" name="ACC_MR__SELPLUS">
        <value caption="Select AFE0_AD0" name="AFE0_AD0" value="0x0"/>
        <value caption="Select AFE0_AD1" name="AFE0_AD1" value="0x1"/>
        <value caption="Select AFE0_AD2" name="AFE0_AD2" value="0x2"/>
        <value caption="Select AFE0_AD3" name="AFE0_AD3" value="0x3"/>
        <value caption="Select AFE0_AD4" name="AFE0_AD4" value="0x4"/>
        <value caption="Select AFE0_AD5" name="AFE0_AD5" value="0x5"/>
        <value caption="Select AFE1_AD0" name="AFE1_AD0" value="0x6"/>
        <value caption="Select AFE1_AD1" name="AFE1_AD1" value="0x7"/>
      </value-group>
      <value-group caption="" name="ACC_MR__ACEN">
        <value caption="Analog comparator disabled." name="DIS" value="0"/>
        <value caption="Analog comparator enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__EDGETYP">
        <value caption="Only rising edge of comparator output" name="RISING" value="0x0"/>
        <value caption="Falling edge of comparator output" name="FALLING" value="0x1"/>
        <value caption="Any edge of comparator output" name="ANY" value="0x2"/>
      </value-group>
      <value-group caption="" name="ACC_MR__INV">
        <value caption="Analog comparator output is directly processed." name="DIS" value="0"/>
        <value caption="Analog comparator output is inverted prior to being processed." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__SELFS">
        <value caption="The CE flag is used to drive the FAULT output." name="CE" value="0"/>
        <value caption="The output of the analog comparator flag is used to drive the FAULT output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_MR__FE">
        <value caption="The FAULT output is tied to 0." name="DIS" value="0"/>
        <value caption="The FAULT output is driven by the signal defined by SELFS." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_ACR__ISEL">
        <value caption="Low-power option." name="LOPW" value="0"/>
        <value caption="High-speed option." name="HISP" value="1"/>
      </value-group>
      <value-group caption="" name="ACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x414343"/>
      </value-group>
    </module>
    <module caption="Advanced Encryption Standard" name="AES" version="6149S">
      <register-group name="AES">
        <register caption="Control Register" name="AES_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="AES_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Processing Mode" mask="0x00000001" name="CIPHER"/>
          <bitfield caption="GCM Automatic Tag Generation Enable" mask="0x00000002" name="GTAGEN"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000008" name="DUALBUFF" values="AES_MR__DUALBUFF"/>
          <bitfield caption="Processing Delay" mask="0x000000F0" name="PROCDLY"/>
          <bitfield caption="Start Mode" mask="0x00000300" name="SMOD" values="AES_MR__SMOD"/>
          <bitfield caption="Key Size" mask="0x00000C00" name="KEYSIZE" values="AES_MR__KEYSIZE"/>
          <bitfield caption="Operation Mode" mask="0x00007000" name="OPMOD" values="AES_MR__OPMOD"/>
          <bitfield caption="Last Output Data Mode" mask="0x00008000" name="LOD"/>
          <bitfield caption="Cipher Feedback Data Size" mask="0x00070000" name="CFBS" values="AES_MR__CFBS"/>
          <bitfield caption="Key" mask="0x00F00000" name="CKEY" values="AES_MR__CKEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="AES_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Enable" mask="0x00010000" name="TAGRDY"/>
        </register>
