Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70Q19.xml
        <register caption="Write Protection Status Register" name="MATRIX_WPSR" offset="0x01E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="MATRIX_MCFG0__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLTD_LENGTH" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE_ACCESS" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4BEAT_BURST" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8BEAT_BURST" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16BEAT_BURST" value="0x4"/>
        <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32BEAT_BURST" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64BEAT_BURST" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats." name="_128BEAT_BURST" value="0x7"/>
      </value-group>
      <value-group caption="" name="MATRIX_MCFG1__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLTD_LENGTH" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE_ACCESS" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4BEAT_BURST" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8BEAT_BURST" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16BEAT_BURST" value="0x4"/>
        <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32BEAT_BURST" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64BEAT_BURST" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats." name="_128BEAT_BURST" value="0x7"/>
      </value-group>
      <value-group caption="" name="MATRIX_MCFG2__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLTD_LENGTH" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE_ACCESS" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4BEAT_BURST" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8BEAT_BURST" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16BEAT_BURST" value="0x4"/>
        <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32BEAT_BURST" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64BEAT_BURST" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats." name="_128BEAT_BURST" value="0x7"/>
      </value-group>
      <value-group caption="" name="MATRIX_MCFG3__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLTD_LENGTH" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE_ACCESS" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4BEAT_BURST" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8BEAT_BURST" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16BEAT_BURST" value="0x4"/>
        <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32BEAT_BURST" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64BEAT_BURST" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats." name="_128BEAT_BURST" value="0x7"/>
      </value-group>
      <value-group caption="" name="MATRIX_MCFG4__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLTD_LENGTH" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE_ACCESS" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4BEAT_BURST" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8BEAT_BURST" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16BEAT_BURST" value="0x4"/>
        <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32BEAT_BURST" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64BEAT_BURST" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats." name="_128BEAT_BURST" value="0x7"/>
      </value-group>
      <value-group caption="" name="MATRIX_MCFG5__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLTD_LENGTH" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE_ACCESS" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4BEAT_BURST" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8BEAT_BURST" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16BEAT_BURST" value="0x4"/>
        <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32BEAT_BURST" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64BEAT_BURST" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats." name="_128BEAT_BURST" value="0x7"/>
      </value-group>
