Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70Q19.xml
        <register caption="Global Channel Disable Register" name="XDMAC_GD" offset="0x20" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Disable Bit" mask="0x00000001" name="DI0"/>
          <bitfield caption="XDMAC Channel 1 Disable Bit" mask="0x00000002" name="DI1"/>
          <bitfield caption="XDMAC Channel 2 Disable Bit" mask="0x00000004" name="DI2"/>
          <bitfield caption="XDMAC Channel 3 Disable Bit" mask="0x00000008" name="DI3"/>
          <bitfield caption="XDMAC Channel 4 Disable Bit" mask="0x00000010" name="DI4"/>
          <bitfield caption="XDMAC Channel 5 Disable Bit" mask="0x00000020" name="DI5"/>
          <bitfield caption="XDMAC Channel 6 Disable Bit" mask="0x00000040" name="DI6"/>
          <bitfield caption="XDMAC Channel 7 Disable Bit" mask="0x00000080" name="DI7"/>
          <bitfield caption="XDMAC Channel 8 Disable Bit" mask="0x00000100" name="DI8"/>
          <bitfield caption="XDMAC Channel 9 Disable Bit" mask="0x00000200" name="DI9"/>
          <bitfield caption="XDMAC Channel 10 Disable Bit" mask="0x00000400" name="DI10"/>
          <bitfield caption="XDMAC Channel 11 Disable Bit" mask="0x00000800" name="DI11"/>
          <bitfield caption="XDMAC Channel 12 Disable Bit" mask="0x00001000" name="DI12"/>
          <bitfield caption="XDMAC Channel 13 Disable Bit" mask="0x00002000" name="DI13"/>
          <bitfield caption="XDMAC Channel 14 Disable Bit" mask="0x00004000" name="DI14"/>
          <bitfield caption="XDMAC Channel 15 Disable Bit" mask="0x00008000" name="DI15"/>
          <bitfield caption="XDMAC Channel 16 Disable Bit" mask="0x00010000" name="DI16"/>
          <bitfield caption="XDMAC Channel 17 Disable Bit" mask="0x00020000" name="DI17"/>
          <bitfield caption="XDMAC Channel 18 Disable Bit" mask="0x00040000" name="DI18"/>
          <bitfield caption="XDMAC Channel 19 Disable Bit" mask="0x00080000" name="DI19"/>
          <bitfield caption="XDMAC Channel 20 Disable Bit" mask="0x00100000" name="DI20"/>
          <bitfield caption="XDMAC Channel 21 Disable Bit" mask="0x00200000" name="DI21"/>
          <bitfield caption="XDMAC Channel 22 Disable Bit" mask="0x00400000" name="DI22"/>
          <bitfield caption="XDMAC Channel 23 Disable Bit" mask="0x00800000" name="DI23"/>
        </register>
        <register caption="Global Channel Status Register" name="XDMAC_GS" offset="0x24" rw="R" size="4">
          <bitfield caption="XDMAC Channel 0 Status Bit" mask="0x00000001" name="ST0"/>
          <bitfield caption="XDMAC Channel 1 Status Bit" mask="0x00000002" name="ST1"/>
          <bitfield caption="XDMAC Channel 2 Status Bit" mask="0x00000004" name="ST2"/>
          <bitfield caption="XDMAC Channel 3 Status Bit" mask="0x00000008" name="ST3"/>
          <bitfield caption="XDMAC Channel 4 Status Bit" mask="0x00000010" name="ST4"/>
          <bitfield caption="XDMAC Channel 5 Status Bit" mask="0x00000020" name="ST5"/>
          <bitfield caption="XDMAC Channel 6 Status Bit" mask="0x00000040" name="ST6"/>
          <bitfield caption="XDMAC Channel 7 Status Bit" mask="0x00000080" name="ST7"/>
          <bitfield caption="XDMAC Channel 8 Status Bit" mask="0x00000100" name="ST8"/>
          <bitfield caption="XDMAC Channel 9 Status Bit" mask="0x00000200" name="ST9"/>
          <bitfield caption="XDMAC Channel 10 Status Bit" mask="0x00000400" name="ST10"/>
          <bitfield caption="XDMAC Channel 11 Status Bit" mask="0x00000800" name="ST11"/>
          <bitfield caption="XDMAC Channel 12 Status Bit" mask="0x00001000" name="ST12"/>
          <bitfield caption="XDMAC Channel 13 Status Bit" mask="0x00002000" name="ST13"/>
          <bitfield caption="XDMAC Channel 14 Status Bit" mask="0x00004000" name="ST14"/>
          <bitfield caption="XDMAC Channel 15 Status Bit" mask="0x00008000" name="ST15"/>
          <bitfield caption="XDMAC Channel 16 Status Bit" mask="0x00010000" name="ST16"/>
          <bitfield caption="XDMAC Channel 17 Status Bit" mask="0x00020000" name="ST17"/>
          <bitfield caption="XDMAC Channel 18 Status Bit" mask="0x00040000" name="ST18"/>
          <bitfield caption="XDMAC Channel 19 Status Bit" mask="0x00080000" name="ST19"/>
          <bitfield caption="XDMAC Channel 20 Status Bit" mask="0x00100000" name="ST20"/>
          <bitfield caption="XDMAC Channel 21 Status Bit" mask="0x00200000" name="ST21"/>
          <bitfield caption="XDMAC Channel 22 Status Bit" mask="0x00400000" name="ST22"/>
          <bitfield caption="XDMAC Channel 23 Status Bit" mask="0x00800000" name="ST23"/>
        </register>
        <register caption="Global Channel Read Suspend Register" name="XDMAC_GRS" offset="0x28" rw="RW" size="4">
          <bitfield caption="XDMAC Channel 0 Read Suspend Bit" mask="0x00000001" name="RS0"/>
          <bitfield caption="XDMAC Channel 1 Read Suspend Bit" mask="0x00000002" name="RS1"/>
          <bitfield caption="XDMAC Channel 2 Read Suspend Bit" mask="0x00000004" name="RS2"/>
          <bitfield caption="XDMAC Channel 3 Read Suspend Bit" mask="0x00000008" name="RS3"/>
          <bitfield caption="XDMAC Channel 4 Read Suspend Bit" mask="0x00000010" name="RS4"/>
          <bitfield caption="XDMAC Channel 5 Read Suspend Bit" mask="0x00000020" name="RS5"/>
          <bitfield caption="XDMAC Channel 6 Read Suspend Bit" mask="0x00000040" name="RS6"/>
          <bitfield caption="XDMAC Channel 7 Read Suspend Bit" mask="0x00000080" name="RS7"/>
          <bitfield caption="XDMAC Channel 8 Read Suspend Bit" mask="0x00000100" name="RS8"/>
          <bitfield caption="XDMAC Channel 9 Read Suspend Bit" mask="0x00000200" name="RS9"/>
          <bitfield caption="XDMAC Channel 10 Read Suspend Bit" mask="0x00000400" name="RS10"/>
          <bitfield caption="XDMAC Channel 11 Read Suspend Bit" mask="0x00000800" name="RS11"/>
          <bitfield caption="XDMAC Channel 12 Read Suspend Bit" mask="0x00001000" name="RS12"/>
          <bitfield caption="XDMAC Channel 13 Read Suspend Bit" mask="0x00002000" name="RS13"/>
          <bitfield caption="XDMAC Channel 14 Read Suspend Bit" mask="0x00004000" name="RS14"/>
          <bitfield caption="XDMAC Channel 15 Read Suspend Bit" mask="0x00008000" name="RS15"/>
          <bitfield caption="XDMAC Channel 16 Read Suspend Bit" mask="0x00010000" name="RS16"/>
          <bitfield caption="XDMAC Channel 17 Read Suspend Bit" mask="0x00020000" name="RS17"/>
          <bitfield caption="XDMAC Channel 18 Read Suspend Bit" mask="0x00040000" name="RS18"/>
          <bitfield caption="XDMAC Channel 19 Read Suspend Bit" mask="0x00080000" name="RS19"/>
          <bitfield caption="XDMAC Channel 20 Read Suspend Bit" mask="0x00100000" name="RS20"/>
          <bitfield caption="XDMAC Channel 21 Read Suspend Bit" mask="0x00200000" name="RS21"/>
          <bitfield caption="XDMAC Channel 22 Read Suspend Bit" mask="0x00400000" name="RS22"/>
          <bitfield caption="XDMAC Channel 23 Read Suspend Bit" mask="0x00800000" name="RS23"/>
        </register>
        <register caption="Global Channel Write Suspend Register" name="XDMAC_GWS" offset="0x2C" rw="RW" size="4">
          <bitfield caption="XDMAC Channel 0 Write Suspend Bit" mask="0x00000001" name="WS0"/>
          <bitfield caption="XDMAC Channel 1 Write Suspend Bit" mask="0x00000002" name="WS1"/>
          <bitfield caption="XDMAC Channel 2 Write Suspend Bit" mask="0x00000004" name="WS2"/>
          <bitfield caption="XDMAC Channel 3 Write Suspend Bit" mask="0x00000008" name="WS3"/>
          <bitfield caption="XDMAC Channel 4 Write Suspend Bit" mask="0x00000010" name="WS4"/>
          <bitfield caption="XDMAC Channel 5 Write Suspend Bit" mask="0x00000020" name="WS5"/>
          <bitfield caption="XDMAC Channel 6 Write Suspend Bit" mask="0x00000040" name="WS6"/>
          <bitfield caption="XDMAC Channel 7 Write Suspend Bit" mask="0x00000080" name="WS7"/>
          <bitfield caption="XDMAC Channel 8 Write Suspend Bit" mask="0x00000100" name="WS8"/>
          <bitfield caption="XDMAC Channel 9 Write Suspend Bit" mask="0x00000200" name="WS9"/>
          <bitfield caption="XDMAC Channel 10 Write Suspend Bit" mask="0x00000400" name="WS10"/>
          <bitfield caption="XDMAC Channel 11 Write Suspend Bit" mask="0x00000800" name="WS11"/>
          <bitfield caption="XDMAC Channel 12 Write Suspend Bit" mask="0x00001000" name="WS12"/>
          <bitfield caption="XDMAC Channel 13 Write Suspend Bit" mask="0x00002000" name="WS13"/>
          <bitfield caption="XDMAC Channel 14 Write Suspend Bit" mask="0x00004000" name="WS14"/>
          <bitfield caption="XDMAC Channel 15 Write Suspend Bit" mask="0x00008000" name="WS15"/>
          <bitfield caption="XDMAC Channel 16 Write Suspend Bit" mask="0x00010000" name="WS16"/>
          <bitfield caption="XDMAC Channel 17 Write Suspend Bit" mask="0x00020000" name="WS17"/>
          <bitfield caption="XDMAC Channel 18 Write Suspend Bit" mask="0x00040000" name="WS18"/>
          <bitfield caption="XDMAC Channel 19 Write Suspend Bit" mask="0x00080000" name="WS19"/>
          <bitfield caption="XDMAC Channel 20 Write Suspend Bit" mask="0x00100000" name="WS20"/>
          <bitfield caption="XDMAC Channel 21 Write Suspend Bit" mask="0x00200000" name="WS21"/>
          <bitfield caption="XDMAC Channel 22 Write Suspend Bit" mask="0x00400000" name="WS22"/>
          <bitfield caption="XDMAC Channel 23 Write Suspend Bit" mask="0x00800000" name="WS23"/>
        </register>
        <register caption="Global Channel Read Write Suspend Register" name="XDMAC_GRWS" offset="0x30" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Read Write Suspend Bit" mask="0x00000001" name="RWS0"/>
          <bitfield caption="XDMAC Channel 1 Read Write Suspend Bit" mask="0x00000002" name="RWS1"/>
          <bitfield caption="XDMAC Channel 2 Read Write Suspend Bit" mask="0x00000004" name="RWS2"/>
          <bitfield caption="XDMAC Channel 3 Read Write Suspend Bit" mask="0x00000008" name="RWS3"/>
          <bitfield caption="XDMAC Channel 4 Read Write Suspend Bit" mask="0x00000010" name="RWS4"/>
          <bitfield caption="XDMAC Channel 5 Read Write Suspend Bit" mask="0x00000020" name="RWS5"/>
          <bitfield caption="XDMAC Channel 6 Read Write Suspend Bit" mask="0x00000040" name="RWS6"/>
          <bitfield caption="XDMAC Channel 7 Read Write Suspend Bit" mask="0x00000080" name="RWS7"/>
          <bitfield caption="XDMAC Channel 8 Read Write Suspend Bit" mask="0x00000100" name="RWS8"/>
          <bitfield caption="XDMAC Channel 9 Read Write Suspend Bit" mask="0x00000200" name="RWS9"/>
          <bitfield caption="XDMAC Channel 10 Read Write Suspend Bit" mask="0x00000400" name="RWS10"/>
          <bitfield caption="XDMAC Channel 11 Read Write Suspend Bit" mask="0x00000800" name="RWS11"/>
          <bitfield caption="XDMAC Channel 12 Read Write Suspend Bit" mask="0x00001000" name="RWS12"/>
          <bitfield caption="XDMAC Channel 13 Read Write Suspend Bit" mask="0x00002000" name="RWS13"/>
          <bitfield caption="XDMAC Channel 14 Read Write Suspend Bit" mask="0x00004000" name="RWS14"/>
          <bitfield caption="XDMAC Channel 15 Read Write Suspend Bit" mask="0x00008000" name="RWS15"/>
          <bitfield caption="XDMAC Channel 16 Read Write Suspend Bit" mask="0x00010000" name="RWS16"/>
          <bitfield caption="XDMAC Channel 17 Read Write Suspend Bit" mask="0x00020000" name="RWS17"/>
          <bitfield caption="XDMAC Channel 18 Read Write Suspend Bit" mask="0x00040000" name="RWS18"/>
          <bitfield caption="XDMAC Channel 19 Read Write Suspend Bit" mask="0x00080000" name="RWS19"/>
          <bitfield caption="XDMAC Channel 20 Read Write Suspend Bit" mask="0x00100000" name="RWS20"/>
          <bitfield caption="XDMAC Channel 21 Read Write Suspend Bit" mask="0x00200000" name="RWS21"/>
          <bitfield caption="XDMAC Channel 22 Read Write Suspend Bit" mask="0x00400000" name="RWS22"/>
          <bitfield caption="XDMAC Channel 23 Read Write Suspend Bit" mask="0x00800000" name="RWS23"/>
        </register>
